src/cfe/КСП/Documents/КСП_КурсовоеСоглашение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_КурсовоеСоглашение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КСП_КурсовыеСоглашения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коллекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПредоплаты1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПредоплаты2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПредоплаты3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Соглашение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КурсОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПредоплатыСоСвободногоСклада</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_КурсовоеСоглашение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоглашениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		
		ТекСтрока = Элемент.ТекущаяСтрока;
		ИндексПредыдущейСтроки = Объект.Соглашение.Количество() - 2;
		
		Если ИндексПредыдущейСтроки >= 0 Тогда
			ПредыдущаяСтрока = Объект.Соглашение[ИндексПредыдущейСтроки];
			Если ЗначениеЗаполнено(ПредыдущаяСтрока.КурсДо) Тогда			
				Элемент.ТекущиеДанные.КурсОт = ПредыдущаяСтрока.КурсДо + 0.01;
			КонецЕсли;
		КонецЕсли;
		//ИндексТекСтроки = Объект.Товары.Индекс(ТекСтрока);
		//ВсегоСтрок = Объект.Товары.Количество();

		//ПредСтрока = ?(ИндексТекСтроки, Объект.Товары[ИндексТекСтроки-1], Неопределено);
		//СледСтрока = ?(ИндексТекСтроки < ВсегоСтрок-1, Объект.Товары[ИндексТекСтроки+1], Неопределено);
		//
		//а = Элемент.ТекущиеДанные;		
		//а.Сумма = 100;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)


КонецПроцедуры

&НаСервере
Функция ПолучитьСодержаниеЯчейки(пТабличныйДокумент, Строка, Колонка)	
	Если Колонка = 0 Тогда
		Возврат "";
	КонецЕсли;	
	мСодержание = пТабличныйДокумент.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст;	
	Возврат СокрЛП(мСодержание);
КонецФункции

&НаСервере
Функция СтрокаЗаполнена(ТабДок, номерСтроки)
	заполнено = Ложь;
	Для номерКолонки = 1 По 6 Цикл
		Если ЗначениеЗаполнено(ПолучитьСодержаниеЯчейки(ТабДок, номерСтроки, номерКолонки)) Тогда
			заполнено = Истина;
		КонецЕсли;
	КонецЦикла;

	возврат заполнено;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТабДок = ЭтаФорма.ТабличныйДокумент;
	мВысотаТабличногоДокумента = ТабДок.ВысотаТаблицы;
	ТекущийОбъект.Соглашение.Очистить();
	Для Строка = 2 По мВысотаТабличногоДокумента Цикл
		Если СтрокаЗаполнена(ТабДок, Строка) Тогда
			НоваяСтр = ТекущийОбъект.Соглашение.Добавить();
			НоваяСтр.КурсОт = ПолучитьСодержаниеЯчейки(ТабДок, Строка, 1);
			НоваяСтр.КурсДо = ПолучитьСодержаниеЯчейки(ТабДок, Строка, 2);
			НоваяСтр.ПроцентПредоплатыСоСвободногоСклада = ПолучитьСодержаниеЯчейки(ТабДок, Строка, 3);
			НоваяСтр.Цена1 = ПолучитьСодержаниеЯчейки(ТабДок, Строка, 4);
			НоваяСтр.Цена2 = ПолучитьСодержаниеЯчейки(ТабДок, Строка, 5);
			НоваяСтр.Цена3 = ПолучитьСодержаниеЯчейки(ТабДок, Строка, 6);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция ЗаписатьСодержаниеЯчейки(пТабличныйДокумент, Строка, Колонка, мСодержание)	
	Если Колонка = 0 Тогда
		Возврат "";
	КонецЕсли;	
	пТабличныйДокумент.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст = мСодержание;	
	Возврат СокрЛП(мСодержание);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МакетЗаполненияПоВнешнемуИсточнику = Документы.КСП_КурсовоеСоглашение.ПолучитьМакет("МакетЗагрузкиДанных");
	ТабличныйДокумент.Очистить();
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Заголовок");
	ТабличныйДокумент.Присоединить(ОбластьТовары);

	ТабличныйДокумент.ФиксацияСверху = 1;

	НомерСтроки = 1;
	Для каждого текСтрока Из Объект.Соглашение Цикл
		НомерСтроки = НомерСтроки + 1;
		ЗаписатьСодержаниеЯчейки(ЭтаФорма.ТабличныйДокумент, НомерСтроки, 1, текСтрока.КурсОт);
		ЗаписатьСодержаниеЯчейки(ЭтаФорма.ТабличныйДокумент, НомерСтроки, 2, текСтрока.КурсДо);
		ЗаписатьСодержаниеЯчейки(ЭтаФорма.ТабличныйДокумент, НомерСтроки, 3, текСтрока.ПроцентПредоплатыСоСвободногоСклада);
		ЗаписатьСодержаниеЯчейки(ЭтаФорма.ТабличныйДокумент, НомерСтроки, 4, текСтрока.Цена1);
		ЗаписатьСодержаниеЯчейки(ЭтаФорма.ТабличныйДокумент, НомерСтроки, 5, текСтрока.Цена2);
		ЗаписатьСодержаниеЯчейки(ЭтаФорма.ТабличныйДокумент, НомерСтроки, 6, текСтрока.Цена3);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	табПечати = Новый ТабличныйДокумент;
	МакетПечати = Документы.КСП_КурсовоеСоглашение.ПолучитьМакет("МакетПечати");
	
	ОбластьЗаголовок = МакетПечати.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Коллекция = Объект.Коллекция.Наименование;
	табПечати.Присоединить(ОбластьЗаголовок);
	
	Для каждого текСтрока Из Объект.Соглашение Цикл
		ОбластьСтрока = МакетПечати.ПолучитьОбласть("Строка");
		ОбластьСтрока.Параметры.ТипСкидки = СокрЛП(текСтрока.КурсОт) + " - " + СокрЛП(текСтрока.КурсДо);
		ОбластьСтрока.Параметры.УровеньЦены = текСтрока.ПроцентПредоплатыСоСвободногоСклада;
		ОбластьСтрока.Параметры.Цена1 = текСтрока.Цена1;
		ОбластьСтрока.Параметры.Цена2 = текСтрока.Цена2;
		ОбластьСтрока.Параметры.Цена3 = текСтрока.Цена3;
		табПечати.Присоединить(ОбластьСтрока);
	КонецЦикла;

	ОбластьПодвал = МакетПечати.ПолучитьОбласть("Подвал");
	табПечати.Присоединить(ОбластьПодвал);

	табПечати.ФиксацияСверху = 13;
	
	возврат табПечати;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	
	табПечати  = ПечатьНаСервере();
	табПечати.Показать();

КонецПроцедуры
